Tekla Open API Reference for Tekla Structures 2025
SeamVisibilityAttributes Constructor
Overload List
Name | Description
WeldMark.SeamVisibilityAttributes()
 Creates a new weld seam visibility attributes instance.
WeldMark.SeamVisibilityAttributes(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Creates a new weld seam visibility attributes instance with the given attributes.
Top
See Also
Reference
WeldMark.SeamVisibilityAttributes Class
Tekla.Structures.Drawing Namespace